DataProcessors/ИзвенитьпутиКартинки/ИзвенитьпутиКартинки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИзвенитьпутиКартинки</name>
</mdclass:DataProcessor>

Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.абс_СертификатНаТовары</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.Событие</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

DataProcessors/ИзвенитьпутиКартинки/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	 ВыполнитьНажатиеСервер()	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНажатиеСервер()Экспорт
	// Вставить НажатиеСервер обработчика.
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Ссылка,
		|	ХранилищеДополнительнойИнформации.ВерсияДанных,
		|	ХранилищеДополнительнойИнформации.ПометкаУдаления,
		|	ХранилищеДополнительнойИнформации.Предопределенный,
		|	ХранилищеДополнительнойИнформации.Наименование,
		|	ХранилищеДополнительнойИнформации.ВидДанных,
		|	ХранилищеДополнительнойИнформации.ИмяФайла,
		|	ХранилищеДополнительнойИнформации.Объект,
		|	ХранилищеДополнительнойИнформации.Хранилище,
		|	ХранилищеДополнительнойИнформации.ТекстФайла,
		|	ХранилищеДополнительнойИнформации.абс_ДатаПрикрепленияФайла,
		|	ХранилищеДополнительнойИнформации.абс_ИнициаторФайла,
		|	ХранилищеДополнительнойИнформации.абс_ИмяФайла,
		|	ХранилищеДополнительнойИнформации.Представление
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
      счетчик=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		путь=ВыборкаДетальныеЗаписи.Хранилище.получить();
		Расширение = Прав(СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.абс_ИмяФайла), 4); 
		Если  Расширение = ".tif"  Тогда
			Спр = ВыборкаДетальныеЗаписи.Ссылка.получитьОбъект();
			ПрифексСтраницы = "p" ;
			ИндексСтраницы = 1;
			СтароеИмя = ВыборкаДетальныеЗаписи.Ссылка.абс_ИмяФайла;
			НовоеИмя =  Лев(ВыборкаДетальныеЗаписи.Ссылка.абс_ИмяФайла,(СтрДлина(ВыборкаДетальныеЗаписи.Ссылка.абс_ИмяФайла)-3))+ПрифексСтраницы + ИндексСтраницы + ".jpg";
			СтароеИмяБезПапки  = Спр.ИмяФайла;
			НовоеИмяБезПапки = Спр.ИмяФайла + "." + ПрифексСтраницы + ИндексСтраницы;
			Спр.абс_ИмяФайла= НовоеИмя;
			Спр.ИмяФайла	 =	НовоеИмяБезПапки;	
            Спр.Наименование =  НовоеИмяБезПапки;
			спрХран= ВыборкаДетальныеЗаписи.Хранилище.Получить();
			НовХранилище =  Лев(спрХран,(СтрДлина(спрХран)-3))+ПрифексСтраницы + ИндексСтраницы + ".jpg" ;
			Спр.Хранилище= Новый ХранилищеЗначения(НовХранилище);
			сообщить(Спр.абс_ИмяФайла);  	
			счетчик=счетчик+1;			
			Спр.записать();
			
			ПроверитьСуществованиеФайла = Истина;
			Пока ПроверитьСуществованиеФайла Цикл
				ИндексСтраницы = ИндексСтраницы + 1;
				НовоеИмя =  Лев(СтароеИмя,(СтрДлина(СтароеИмя)-3))+ПрифексСтраницы + ИндексСтраницы + ".jpg";
				НовоеИмяБезПапки =  СтароеИмяБезПапки +  "." +  ПрифексСтраницы + ИндексСтраницы;
			    НайденныеФайлы = НайтиФайлы(НовоеИмя,,);
				Если НайденныеФайлы.Количество()= 1 Тогда
					НовыйЭлемент =  Спр.Скопировать();
					//НовыйЭлемент = 	Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();	
					НовыйЭлемент.абс_ИмяФайла= НовоеИмя;
					НовыйЭлемент.ИмяФайла	 =	НовоеИмяБезПапки;	
          			НовыйЭлемент.Наименование =  НовоеИмяБезПапки;
					НовыйЭлемент.Хранилище= Новый ХранилищеЗначения(Лев(спрХран,(СтрДлина(спрХран)-3))+ПрифексСтраницы + ИндексСтраницы + ".jpg");
					НовыйЭлемент.Записать();
					сообщить(НовоеИмя);  	
					счетчик=счетчик+1;
					
				ИначеЕсли НайденныеФайлы.Количество()= 0 Тогда
					 ПроверитьСуществованиеФайла = Ложь;	
				КонецЕсли;
			   
			
			КонецЦикла;
			
			
		КонецЕсли;
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
     
    сообщить(счетчик);  

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
      КонецПроцедуры
